Autodesk.Revit.DB.ShapeImporter.SetDefaultLengthUnit(Autodesk.Revit.DB.ImportUnit)
Sets the length unit to be used if not specified in the input SAT file.
Remarks:
Values ImportUnit::Default and ImportUnit::Custom are ignored. ImportUnit::Centimeter is used instead.
defaultLengthUnit:
The length unit to be used if not specified in the input SAT file.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2017_subscription_update

Autodesk.Revit.DB.ShapeImporter.IsServiceAvailable
Checks whether the data conversion service is available.
Remarks:
ShapeImporter relies on optional data conversion functionality. This function checks whether it is available.
Returns:
True if the data conversion service is available, false otherwise.
Since:
2017

Autodesk.Revit.DB.ShapeImporter.Convert(Autodesk.Revit.DB.Document,System.String)
Converts the geometry stored in the external format into a collection of Revit geometry objects.
document:
The Revit document where the resulting Revit geometry objects will be used. This document may need to be modified
to store dependent elements such as graphics styles and/or materials.
filename:
The full path to the input file.
Returns:
A collection of Revit geometry objects created from the incoming data.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given filename does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Data conversion service is not available.
Since:
2017

Autodesk.Revit.DB.ShapeImporter.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ShapeImporter.DefaultLengthUnit
The length unit to be used if not specified in the input SAT file.
Remarks:
If the input SAT file is unitless then this length unit will be used as a backup.
Since:
2017

Autodesk.Revit.DB.ShapeImporter.InputFormat
The format of the incoming data.
Remarks:
If this option is set to Auto (the default), the file name extension will be used to determine the input format. That covers most file-based data import workflows.
Specify the input format explicitly to perform an additional sanity check or if you are using a non-standard file extension.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2017

Autodesk.Revit.DB.ShapeImporter.#ctor
Default constructor. Initializes an instance of ShapeImporter that will automaticall?y recognize the file format from its extension (ShapeImporterSourceFormat.Auto).
Since:
2017

Autodesk.Revit.DB.ShapeImporter
An utility class that supports conversion of geometry stored in an external format into a Revit geometry objects.
Remarks:
See Autodesk.Revit.DB.ShapeImporterSourceFormat for the list of supported formats.
Since:
2017